Repository: ocean2002n/step_challenge_app
Catalog: lib/l10n/app_*.arb
Languages: km, zh

source: Flashlight
km: ពិលភ្លើង
zh: 閃光燈

source: Switch Camera
km: ប្តូរកាមេរ៉ា
zh: 切換鏡頭

# alignQrCodeToFrame
source: Align QR code within the frame to scan
km: តម្រឹម QR កូដក្នុងស៊ុមដើម្បីស្កេន
zh: 將QR碼對準框內掃描

# keepQrCodeClear
source: Keep QR code clear and visible
km: រក្សា QR កូដឱ្យច្បាស់
zh: 請保持QR碼清晰可見

source: Adding friend...
km: កំពុងបន្ថែមមិត្តភក្តិ...
zh: 正在添加好友...

source: Enter invite code manually
km: បញ្ចូលកូដអញ្ជើញដោយដៃ
zh: 手動輸入邀請碼

# cameraPermissionNeeded
source: Need camera permission to scan QR codes
km: ត្រូវការការអនុញ្ញាតកាមេរ៉ាដើម្បីស្កេន QR កូដ
zh: 需要相機權限才能掃描QR碼

source: Friend added successfully!
km: បន្ថែមមិត្តភក្តិបានជោគជ័យ!
zh: 好友添加成功！

source: Invalid QR code or already friends
km: QR កូដមិនត្រឹមត្រូវ ឬជាមិត្តភក្តិរួចហើយ
zh: 無效的QR碼或已經是好友

source: Error processing QR code
km: កំហុសក្នុងការដំណើរការ QR កូដ
zh: 處理QR碼時發生錯誤

source: Enter invite code
km: បញ្ចូលកូដអញ្ជើញ
zh: 輸入邀請碼

# enterFriendInviteCodeDescription
source: Please enter the 5-digit invite code shared by your friend
km: សូមបញ្ចូលកូដអញ្ជើញ 5 ខ្ទង់ដែលមិត្តភក្តិរបស់អ្នកបានចែករំលែក
zh: 請輸入朋友分享的5位邀請碼

source: Linked Accounts
km: គណនីដែលបានភ្ជាប់
zh: 已連結帳號

source: Linked
km: បានភ្ជាប់
zh: 已連結

source: Not linked
km: មិនបានភ្ជាប់
zh: 未連結

source: Link
km: ភ្ជាប់
zh: 連結

source: Unlink
km: ផ្តាច់ការភ្ជាប់
zh: 解除連結

source: account linked successfully
km: គណនីបានភ្ជាប់ដោយជោគជ័យ
zh: 帳號連結成功

source: Link failed
km: ការភ្ជាប់បរាជ័យ
zh: 連結失敗

source: Link error
km: កំហុសក្នុងការភ្ជាប់
zh: 連結時發生錯誤

# confirmUnlinkAccount
source: Are you sure you want to unlink from
km: តើអ្នកពិតជាចង់ផ្តាច់ការភ្ជាប់ពី
zh: 確定要解除與

source: account unlinked successfully
km: គណនីបានផ្តាច់ការភ្ជាប់ដោយជោគជ័យ
zh: 帳號已解除連結

source: Unlink failed
km: ការផ្តាច់ការភ្ជាប់បរាជ័យ
zh: 解除連結失敗
