Repository: ocean2002n/step_challenge_app
Catalog: lib/l10n/app_*.arb
Languages: km, zh

# appTitle
source: Step Challenge
km: បញ្ហាប្រកួតហ្វឹកហាត់
zh: 步數挑戰

source: Home
km: ទំព័រដើម
zh: 首頁

source: Challenges
km: បញ្ហាប្រកួត
zh: 挑戰

source: Profile
km: ប្រវត្តិរូប
zh: 個人

source: Good Morning!
km: អរុណសួស្តី!
zh: 早安！

source: Good Afternoon!
km: ទិវាសួស្តី!
zh: 午安！

source: Good Evening!
km: សាយ័ណ្ហសួស្តី!
zh: 晚安！

# stayActive
source: Stay active today!
km: សូមរក្សាភាពសកម្មនៅថ្ងៃនេះ!
zh: 今天也要保持活力喔！

# todaySteps
source: Today's Steps
km: ថ្ងៃនេះ
zh: 今日步數

source: Weekly Progress
km: ការឈើនទៅមុខប្រចាំសប្តាហ៍
zh: 週進度

source: Goal Progress
km: គោលដៅ
zh: 目標進度

source: Quick Actions
km: សកម្មភាពលឿន
zh: 快速操作

source: Sync Data
km: ធ្វើសមកាលកម្មទិន្នន័យ
zh: 同步數據

source: Set Goal
km: កំណត់គោលដៅ
zh: 設定目標

source: Challenge Activities
km: សកម្មភាពបញ្ហាប្រកួត
zh: 挑戰活動

source: Personal Settings
km: ការកំណត់ផ្ទាល់ខ្លួន
zh: 個人設定

source: Personal Profile
km: ប្រវត្តិរូបផ្ទាល់ខ្លួន
zh: 個人資料

source: Notification Settings
km: ការកំណត់ការជូនដំណឹង
zh: 通知設定

source: Health Data Permission
km: សិទ្ធិទិន្នន័យសុខភាព
zh: 健康數據權限

source: Data sync complete!
km: ការធ្វើសមកាលកម្មទិន្នន័យបានបញ្ចប់!
zh: 數據同步完成！

source: Set Daily Step Goal
km: កំណត់គោលដៅជំហានប្រចាំថ្ងៃ
zh: 設定每日步數目標

source: Goal Steps
km: ជំហានគោលដៅ
zh: 目標步數

source: steps
km: ជំហាន
zh: 步

source: Cancel
km: បោះបង់
zh: 取消

source: Confirm
km: បញ្ជាក់
zh: 確定

# createChallengeInDevelopment
source: Create challenge feature in development...
km: មុខងារបង្កើតបញ្ហាប្រកួតកំពុងអភិវឌ្ឍ...
zh: 創建挑戰功能開發中...

# healthDataAuthorized
source: Health data permission authorized
km: សិទ្ធិទិន្នន័យសុខភាពត្រូវបានអនុញ្ញាត
zh: 健康數據權限已授權

# pleaseEnableHealthData
source: Please enable health data permission in settings
km: សូមបើកសិទ្ធិទិន្នន័យសុខភាពនៅក្នុងការកំណត់
zh: 請在設定中開啟健康數據權限

source: Initializing app...
km: កំពុងចាប់ផ្តើមកម្មវិធី...
zh: 正在初始化應用...

source: Save
km: រក្សាទុក
zh: 儲存

source: Nickname
km: ឈ្មោះហៅក្រៅ
zh: 暱稱

source: Please enter nickname
km: សូមបញ្ចូលឈ្មោះហៅក្រៅ
zh: 請輸入暱稱

source: Gender
km: ភេទ
zh: 性別

source: Male
km: ប្រុស
zh: 男性

source: Female
km: ស្រី
zh: 女性

source: Other
km: ផ្សេងទៀត
zh: 其他

source: Birth Date
km: ថ្ងៃខែឆ្នាំកំណើត
zh: 出生年月日

source: Please select birth date
km: សូមជ្រើសរើសថ្ងៃកំណើត
zh: 請選擇出生日期

source: Height
km: កម្ពស់
zh: 身高

source: Weight
km: ទម្ងន់
zh: 體重

# enterValidHeight
source: Please enter valid height (1-300cm)
km: សូមបញ្ចូលកម្ពស់ត្រឹមត្រូវ (1-300សម)
zh: 請輸入有效的身高(1-300cm)

# enterValidWeight
source: Please enter valid weight (1-500kg)
km: សូមបញ្ចូលទម្ងន់ត្រឹមត្រូវ (1-500គក)
zh: 請輸入有效的體重(1-500kg)

source: Save Personal Profile
km: រក្សាទុកប្រវត្តិរូបផ្ទាល់ខ្លួន
zh: 儲存個人資料

source: Personal profile saved
km: ប្រវត្តិរូបផ្ទាល់ខ្លួនត្រូវបានរក្សាទុក
zh: 個人資料已儲存

source: Save failed
km: ការរក្សាទុកបរាជ័យ
zh: 儲存失敗

source: Image selection error
km: កំហុសក្នុងការជ្រើសរើសរូបភាព
zh: 選擇圖片時發生錯誤

source: Language
km: ភាសា
zh: 語言

source: English
km: អង់គ្លេស
zh: 英文

source: Traditional Chinese
km: ចិនបុរាណ
zh: 繁體中文

source: Khmer
km: ខ្មែរ
zh: 柬文

source: Language Settings
km: ការកំណត់ភាសា
zh: 語言設定

source: Select Language
km: ជ្រើសរើសភាសា
zh: 選擇語言

# restartRequired
source: Restart required to apply language changes
km: ត្រូវការចាប់ផ្តើមឡើងវិញដើម្បីអនុវត្តការផ្លាស់ប្តូរភាសា
zh: 需要重新啟動應用程式以套用語言變更

source: Weekend Walking Challenge
km: បញ្ហាប្រកួតដើរចុងសប្តាហ៍
zh: 週末健走挑戰

# weekendWalkingDescription
source: Let's walk together this weekend, aiming for 8000 steps daily!
km: តោះដើរជាមួយគ្នានៅចុងសប្តាហ៍នេះ គោលដៅ៨០០០ជំហានក្នុងមួយថ្ងៃ!
zh: 這個週末讓我們一起走路，目標是每天8000步！

# tenThousandStepChallenge
source: 10K Steps Master Challenge
km: បញ្ហាប្រកួត១០,០០០ជំហាន
zh: 萬步達人月挑戰

# tenThousandStepDescription
source: Reach 10,000 steps every day for a whole month. Do you dare to challenge?
km: ដើរ១០,០០០ជំហានជារៀងរាល់ថ្ងៃរយៈពេលមួយខែ។ តើអ្នកហ៊ានប្រកួតមែនទេ?
zh: 一整個月每天都要達到10000步，你敢挑戰嗎？

# oneMillionStepChallenge
source: 1 Million Steps Team Challenge
km: បញ្ហាប្រកួត១លានជំហាន
zh: 100萬步總挑戰

# oneMillionStepDescription
source: Work together as a team to reach the goal of 1 million steps!
km: ធ្វើការជាក្រុមដើម្បីឈានដល់គោលដៅ១លានជំហាន!
zh: 團隊合作達成100萬步總目標！

# noActiveChallenges
source: No active challenges currently
km: បច្ចុប្បន្នមិនមានបញ្ហាប្រកួតកំពុងដំណើរការទេ
zh: 目前沒有進行中的挑戰

# createNewChallengePrompt
source: Create a new challenge and invite friends to exercise together!
km: បង្កើតបញ្ហាប្រកួតថ្មីនិងអញ្ជើញមិត្តភ័ក្តិឱ្យធ្វើលំហាត់ប្រាណជាមួយគ្នា!
zh: 創建一個新挑戰邀請朋友一起運動吧！

source: Remaining time
km: ពេលវេលានៅសល់
zh: 剩餘時間

source: Ended
km: បានបញ្ចប់
zh: 已結束

source: days
km: ថ្ងៃ
zh: 天

source: Challenge Progress
km: ការឈើនទៅមុខនៃបញ្ហាប្រកួត
zh: 挑戰進度

source: participants
km: អ្នកចូលរួម
zh: 位參與者

source: Join
km: ចូលរួម
zh: 加入

source: Ending soon
km: ជិតបញ្ចប់
zh: 即將結束

source: In progress
km: ដំណើរការ
zh: 進行中

source: Daily goal
km: គោលដៅប្រចាំថ្ងៃ
zh: 每日目標

source: Total goal
km: គោលដៅសរុប
zh: 總計目標

source: Duration
km: រយៈពេល
zh: 持續時間

# stepsUnit
source: steps
km: ជំហាន
zh: 步

source: Achieved
km: សម្រេច
zh: 已達成

source: Goal achieved!
km: សម្រេច!
zh: 目標達成！

source: Keep going
km: បន្ត
zh: 繼續加油

source: Exceeded goal
km: លើស
zh: 超出目標

source: Remaining steps
km: នៅសល់
zh: 剩餘步數

# stepsToGoal
source: steps to reach goal
km: ជំហានដល់គោលដៅ
zh: 步達成目標

# goalAchievedCongrats
source: Goal achieved! Keep it up!
km: ល្អណាស់! សម្រេចហើយ!
zh: 太棒了！您已經達成今日目標，繼續保持健康的生活習慣！

# nearGoalMessage
source: Almost there! Keep going!
km: ជិតគោលដៅហើយ! បន្តដើរ!
zh: 快要達成目標了！再走一點就成功了，加油！

# halfwayMessage
source: Halfway done! Keep pushing!
km: ពាក់កណ្តាលហើយ! បន្ត!
zh: 已經完成一半了！繼續努力，目標就在眼前！

# goodStartMessage
source: Great start! Keep walking!
km: ចាប់ផ្តើមល្អ! បន្តដើរ!
zh: 好的開始！每一步都讓您更接近健康目標。

# newDayMessage
source: New day! Take the first step!
km: ថ្ងៃថ្មី! ចាប់ផ្តើម!
zh: 新的一天開始了！走出第一步，向目標邁進！

# thisWeekWalkingRecord
source: This Week's Record
km: កំណត់ត្រាសប្តាហ៍
zh: 本週紀錄

source: No data available
km: មិនមានទិន្នន័យ
zh: 暫無數據

# weeklyTotal
source: Total
km: សរុប
zh: 總計

# dailyAverageSteps
source: Avg steps
km: ជាមធ្យម
zh: 日均

# daysGoalAchieved
source: Goal days
km: ថ្ងៃសម្រេច
zh: 達標

source: Step Goal Reminder
km: ការរំលឹកគោលដៅជំហាន
zh: 步數目標提醒

# stepGoalReminderBody
source: You haven't reached your step goal today. Let's get walking!
km: អ្នកមិនទាន់សម្រេចគោលដៅជំហានថ្ងៃនេះទេ តោះដើរ!
zh: 今天還沒達成步數目標，加油走起來！

source: Challenge Invitation
km: ការអញ្ជើញចូលរួមបញ្ហាប្រកួត
zh: 挑戰邀請

source: Challenge Progress Update
km: បច្ចុប្បន្នភាពការឈើនទៅមុខនៃបញ្ហាប្រកួត
zh: 挑戰進度更新

# clickedChallenge
source: Selected challenge: {challengeTitle}
km: បានជ្រើសរើសបញ្ហាប្រកួត៖ {challengeTitle}
zh: 點選了挑戰: {challengeTitle}

# joinedChallenge
source: Joined challenge: {challengeTitle}
km: បានចូលរួមបញ្ហាប្រកួត៖ {challengeTitle}
zh: 已加入挑戰: {challengeTitle}

# shareChallenge
source: Share challenge: {challengeTitle}
km: ចែករំលែកបញ្ហាប្រកួត៖ {challengeTitle}
zh: 分享挑戰: {challengeTitle}

# goalWith
source: Goal: {goal} steps
km: គោលដៅ៖ {goal} ជំហាន
zh: 目標: {goal} 步

# remainingStepsToGoal
source: Need {remaining} more steps to reach goal
km: ត្រូវការ {remaining} ជំហានទៀតដើម្បីសម្រេចគោលដៅ
zh: 還差 {remaining} 步達成目標

source: Friends
km: មិត្តភក្តិ
zh: 好友

source: Add Friends
km: បន្ថែមមិត្តភក្តិ
zh: 新增好友

source: My QR Code
km: QR កូដរបស់ខ្ញុំ
zh: 我的QR碼

source: Share Invite Link
km: ចែករំលែកតំណភ្ជាប់អញ្ជើញ
zh: 分享邀請連結

source: Scan QR Code
km: ស្កេន QR កូដ
zh: 掃描QR碼

source: Friends List
km: បញ្ជីមិត្តភក្តិ
zh: 好友列表

source: Monthly Steps
km: ជំហានប្រចាំខែ
zh: 月步數

source: Friends' Steps This Month
km: ជំហានមិត្តភក្តិខែនេះ
zh: 好友本月步數

source: No friends yet
km: មិនទាន់មានមិត្តភក្តិទេ
zh: 還沒有好友

# addFriendsPrompt
source: Add friends to see their step progress and compete together!
km: បន្ថែមមិត្តភក្តិដើម្បីមើលការឈើនទៅមុខជំហានរបស់ពួកគេ និងប្រកួតជាមួយគ្នា!
zh: 新增好友來查看他們的步數進度並一起競爭！

# scanToAddFriend
source: Scan this QR code or share the link to add me as a friend
km: ស្កេន QR កូដនេះ ឬចែករំលែកតំណភ្ជាប់ដើម្បីបន្ថែមខ្ញុំជាមិត្តភក្តិ
zh: 掃描此QR碼或分享連結來將我加為好友

# friendInviteTitle
source: Join me on Step Challenge!
km: ចូលរួមជាមួយខ្ញុំនៅលើ Step Challenge!
zh: 和我一起使用步數挑戰！

# friendInviteMessage
source: Hi! I'm using Step Challenge to track my daily steps. Join me and let's motivate each other to stay active!
km: សួស្តី! ខ្ញុំកំពុងប្រើ Step Challenge ដើម្បីតាមដានជំហានប្រចាំថ្ងៃរបស់ខ្ញុំ។ ចូលរួមជាមួយខ្ញុំ ហើយតោះគ្នាជំរុញឱ្យគ្នាទៅគ្នាឱ្យនៅសកម្ម!
zh: 嗨！我正在使用步數挑戰來追蹤我的每日步數。加入我，讓我們互相激勵保持活力！

source: Add Friend
km: បន្ថែមមិត្តភក្តិ
zh: 新增好友

source: Remove Friend
km: លុបមិត្តភក្តិ
zh: 移除好友

# friendAdded
source: Friend added successfully!
km: បានបន្ថែមមិត្តភក្តិដោយជោគជ័យ!
zh: 好友新增成功！

source: Friend removed
km: មិត្តភក្តិត្រូវបានលុប
zh: 好友已移除

# friendAddError
source: Error adding friend
km: មានកំហុសក្នុងការបន្ថែមមិត្តភក្តិ
zh: 新增好友時發生錯誤

source: Invalid QR code
km: QR កូដមិនត្រឹមត្រូវ
zh: 無效的QR碼

source: Share Link
km: ចែករំលែកតំណភ្ជាប់
zh: 分享連結

source: Share
km: ចែករំលែក
zh: 分享

source: Copy Link
km: ចម្លងតំណភ្ជាប់
zh: 複製連結

# linkCopied
source: Link copied to clipboard
km: តំណភ្ជាប់ត្រូវបានចម្លងទៅក្លីបបត
zh: 連結已複製到剪貼板

source: This Month
km: ខែនេះ
zh: 本月

source: Last Month
km: ខែមុន
zh: 上月

# stepsThisMonth
source: {steps} steps this month
km: {steps} ជំហានខែនេះ
zh: 本月 {steps} 步

# rank
source: Rank #{rank}
km: ចំណាត់ថ្នាក់ទី {rank}
zh: 第 {rank} 名

source: You
km: អ្នក
zh: 你

source: Friends Ranking
km: ចំណាត់ថ្នាក់មិត្តភក្តិ
zh: 好友排行榜

source: Apple Health
km: Apple សុខភាព
zh: Apple 健康

source: Connected
km: បានចុកប្រភាប់
zh: 已連接

source: Not Connected
km: មិនបានចុកប្រភាប់
zh: 未連接

source: Sync Health Data
km: ធ្វើសមកាលកម្មតិន្នញ់សុខភាព
zh: 立即同步健康數據

source: Re-authorize Health Data
km: ថ្វើពិនិត្យអនុញ្ញាតតិន្នញ់សុខភាព
zh: 重新授權健康數據

# syncingHealthData
source: Syncing health data from Apple Health...
km: កំពុងធ្វើសមកាលកម្មតិន្នញ់សុខភាពពី Apple សុខភាព...
zh: 正在從 Apple 健康同步健康數據...

source: Sync Complete
km: ការធ្វើសមកាលកម្មបានបញ្ចប់
zh: 同步完成

# todayStepsCount
source: ✅ Today's Steps: {steps}
km: ✅ ជំហានថ្ងៃនេះ៖ {steps}
zh: ✅ 今日步數：{steps}

# monthlyStepsCount
source: 📊 Monthly Steps: {steps}
km: 📊 ជំហានប្រចាំខែ៖ {steps}
zh: 📊 本月步數：{steps}

source: Weekly Average: {steps}
km: ជំហានជាមធ្យមប្រចាំសប្តាហ៍៖ {steps}
zh: 週平均：{steps}

# goalAchievedDays
source: Goal Achieved: {days} days
km: ថ្ងៃដែលសម្រេចគោលដៅ៖ {days} ថ្ងៃ
zh: 達標天數：{days} 天

# syncFailed
source: Sync failed: {error}
km: ការធ្វើសមកាលកម្មបរាជ័យ៖ {error}
zh: 同步失敗：{error}

source: Check Settings
km: ពិនិត្យមើលការកំណត់
zh: 檢查設定

# reauthorizeSuccess
source: Re-authorization successful!
km: ការថ្វើពិនិត្យអនុញ្ញាតជោគជ័យ!
zh: 重新授權成功！

# reauthorizeFailed
source: Re-authorization failed, please check health app settings
km: ការថ្វើពិនិត្យអនុញ្ញាតបរាជ័យ សូមពិនិត្យមើលការកំណត់កម្មវិធីសុខភាព
zh: 重新授權失敗，請檢查健康應用設定

# reauthorizationFailed
source: Re-authorization failed: {error}
km: ការថ្វើពិនិត្យអនុញ្ញាតបរាជ័យ៖ {error}
zh: 重新授權失敗：{error}

# healthDataSyncComplete
source: Health data sync complete! Today's steps: {steps}
km: ការធ្វើសមកាលកម្មតិន្នញ់សុខភាពបានបញ្ចប់! ជំហានថ្ងៃនេះ៖ {steps}
zh: 健康數據同步完成！今日步數：{steps}

source: Health data sync failed
km: ការធ្វើសមកាលកម្មតិន្នញ់សុខភាពបរាជ័យ
zh: 健康數據同步失敗

# welcomeTitle
source: Welcome to Step Challenge!
km: សូមស្វាគមន៍មកកាន់បញ្ហាប្រកួតហ្វឹកហាត់!
zh: 歡迎使用步數挑戰！

# welcomeSubtitle
source: Track your daily steps, compete with friends, and achieve your health goals together.
km: តាមដានជំហានប្រចាំថ្ងៃរបស់អ្នក ប្រកួតជាមួយមិត្តភក្តិ និងសម្រេចគោលដៅសុខភាពជាមួយគ្នា។
zh: 追蹤每日步數，與朋友競爭，一起達成健康目標。

source: Get Started
km: ចាប់ផ្តើម
zh: 開始使用

source: Skip
km: រំលង
zh: 跳過

source: Next
km: បន្ទាប់
zh: 下一步

# onboardingHealthTitle
source: Track Your Health
km: តាមដានសុខភាព
zh: 追蹤健康

# onboardingHealthDescription
source: Monitor your daily steps and health data with Apple Health integration for accurate tracking.
km: តាមដានជំហានប្រចាំថ្ងៃ និងទិន្នន័យសុខភាពរបស់អ្នកជាមួយការរួមបញ្ចូលជាមួយ Apple សុខភាពសម្រាប់ការតាមដានដ៏ជាក់លាក់។
zh: 透過Apple健康整合監控每日步數和健康數據，提供精確追蹤。

# onboardingFriendsTitle
source: Connect with Friends
km: ភ្ជាប់ជាមួយមិត្តភក្តិ
zh: 與朋友連結

# onboardingFriendsDescription
source: Add friends, share QR codes, and see monthly step rankings to stay motivated together.
km: បន្ថែមមិត្តភក្តិ ចែករំលែក QR កូដ និងមើលចំណាត់ថ្នាក់ជំហានប្រចាំខែដើម្បីរក្សាការលើកទឹកចិត្តជាមួយគ្នា។
zh: 新增朋友、分享QR碼，查看月步數排行榜，一起保持動力。

# onboardingChallengesTitle
source: Join Challenges
km: ចូលរួមបញ្ហាប្រកួត
zh: 參加挑戰

# onboardingChallengesDescription
source: Participate in step challenges and compete with others to achieve your fitness goals.
km: ចូលរួមក្នុងបញ្ហាប្រកួតជំហាន និងប្រកួតជាមួយអ្នកដទៃដើម្បីសម្រេចគោលដៅកាយសម្បទារបស់អ្នក។
zh: 參與步數挑戰，與他人競爭以達成您的健身目標。

source: Create Profile
km: បង្កើតប្រវត្តិរូប
zh: 建立個人檔案

source: Basic Information
km: ព័ត៌មានមូលដ្ឋាន
zh: 基本資訊

# basicInformationSubtitle
source: Let's start with some basic details about you
km: តោះចាប់ផ្តើមជាមួយព័ត៌មានមូលដ្ឋានខ្លះ
zh: 讓我們從一些基本資料開始

source: Tap to add photo
km: ចុចដើម្បីបន្ថែមរូបថត
zh: 點擊新增照片

# enterNickname
source: Enter your nickname
km: បញ្ចូលឈ្មោះហៅក្រៅរបស់អ្នក
zh: 輸入您的暱稱

source: Personal Details
km: ព័ត៌មានបុគ្គល
zh: 個人詳情

# personalDetailsSubtitle
source: Tell us a bit more about yourself
km: ប្រាប់យើងបន្តិចអំពីអ្នក
zh: 告訴我們更多關於您的資訊

source: Select Birth Date
km: ជ្រើសរើសថ្ងៃកំណើត
zh: 選擇出生日期

source: Physical Information
km: ព័ត៌មានរាងកាយ
zh: 身體資訊

# physicalInformationSubtitle
source: Help us calculate your health metrics accurately
km: ជួយយើងគណនាសូចនាករសុខភាពដោយត្រឹមត្រូវ
zh: 幫助我們準確計算您的健康指標

# enterHeight
source: Enter your height
km: បញ្ចូលកម្ពស់របស់អ្នក
zh: 輸入您的身高

source: Please enter height
km: សូមបញ្ចូលកម្ពស់របស់អ្នក
zh: 請輸入您的身高

# enterWeight
source: Enter your weight
km: បញ្ចូលទម្ងន់របស់អ្នក
zh: 輸入您的體重

source: Please enter weight
km: សូមបញ្ចូលទម្ងន់របស់អ្នក
zh: 請輸入您的體重

# healthPermissionSubtitle
source: Enable health data access for accurate step tracking
km: បើកការចូលប្រើទិន្នន័យសុខភាពសម្រាប់ការតាមដានជំហានត្រឹមត្រូវ
zh: 啟用健康數據存取以進行精確步數追蹤

# healthPermissionDescription
source: We'll request permission to read your step data from Apple Health. This helps us provide accurate tracking and personalized insights.
km: យើងនឹងស្នើសុំការអនុញ្ញាតអានទិន្នន័យជំហានរបស់អ្នកពីApple Health។ នេះជួយយើងផ្តល់ការតាមដានត្រឹមត្រូវនិងការយល់ដឹងផ្ទាល់ខ្លួន។
zh: 我們將請求從Apple健康讀取您的步數數據的權限。這有助於我們提供準確的追蹤和個人化見解。

source: Please select gender
km: សូមជ្រើសរើសភេទរបស់អ្នក
zh: 請選擇您的性別

source: Complete Registration
km: បញ្ចប់ការចុះឈ្មោះ
zh: 完成註冊

source: Logout
km: ចេញ
zh: 登出

# syncingData
source: Syncing data from Apple Health...
km: កំពុងធ្វើសមកាលកម្មទិន្នន័យពី Apple Health...
zh: 正在從 Apple Health 同步數據...

source: Sync Completed
km: ការធ្វើសមកាលកម្មបានបញ្ចប់
zh: 同步完成

# weeklyAverage
source: 📈 Weekly Average: {steps}
km: 📈 មធ្យមភាគប្រចាំសប្តាហ៍៖ {steps}
zh: 📈 本週平均：{steps}

# goalAchievedCount
source: 🎯 Goal Achieved: {days} days
km: 🎯 សម្រេចគោលដៅ៖ {days} ថ្ងៃ
zh: 🎯 目標達成：{days} 天

# syncFail
source: Sync failed: {error}
km: ការធ្វើសមកាលកម្មបរាជ័យ៖ {error}
zh: 同步失敗：{error}

source: View Settings
km: មើលការកំណត់
zh: 查看設定

# checkingPermissions
source: Checking health data permissions...
km: កំពុងពិនិត្យមើលសិទ្ធិទិន្នន័យសុខភាព...
zh: 正在檢查健康數據權限...

# permissionStatus
source: Permission Status: {status}
km: ស្ថានភាពសិទ្ធិ៖ {status}
zh: 權限狀態：{status}

# authStatus
source: Auth Status: {status}
km: ស្ថានភាពការផ្ទៀងផ្ទាត់៖ {status}
zh: 認證狀態：{status}

source: Authorized
km: បានអនុញ្ញាត
zh: 已授權

source: Unauthorized
km: មិនបានអនុញ្ញាត
zh: 未授權

# supportedDataTypes
source: Supported Data Types: {types}
km: ប្រភេទទិន្នន័យដែលគាំទ្រ៖ {types}
zh: 支援的數據類型：{types}

# error
source: Error: {error}
km: កំហុស៖ {error}
zh: 錯誤：{error}

source: Request Permission Again
km: ស្នើសុំសិទ្ធិម្តងទៀត
zh: 重新請求權限

# logoutConfirmation
source: Are you sure you want to log out? This will clear all local data.
km: តើអ្នកប្រាកដថាចង់ចេញមែនទេ? វានឹងលុបទិន្នន័យក្នុងតំបន់ទាំងអស់។
zh: 確定要登出嗎？這將清除所有本地資料。

source: Your Monthly Performance
km: ការអនុវត្តប្រចាំខែរបស់អ្នក
zh: 你的本月成績

# userRank
source: Rank #{rank}
km: ចំណាត់ថ្នាក់ទី {rank}
zh: 第{rank}名

source: KM
km: គីឡូម៉ែត្រ
zh: 公里

# userSteps
source: {steps} steps
km: {steps} ជំហាន
zh: {steps} 步

source: Friends' Monthly Ranking
km: ចំណាត់ថ្នាក់មិត្តភក្តិប្រចាំខែ
zh: 好友本月步數排行

# youParentheses
source: (You)
km: (អ្នក)
zh: (你)

# kmValue
source: {value} km
km: {value} គីឡូម៉ែត្រ
zh: {value} 公里

# friendsWithoutSteps
source: {count} friends have no step records yet
km: មិត្តភក្តិ {count} នាក់មិនទាន់មានកំណត់ត្រាជំហាននៅឡើយទេ
zh: {count} 位好友還未有步數記錄

# idNumber
source: ID Number/Passport Number
km: លេខអត្តសញ្ញាណប័ណ្ណ/លេខលិខិតឆ្លងដែន
zh: 身分證字號/護照號碼

source: Nationality
km: សញ្ជាតិ
zh: 國籍

# selectNationality
source: Please select nationality
km: សូមជ្រើសរើសសញ្ជាតិ
zh: 請選擇國籍

source: Phone Number
km: លេខទូរស័ព្ទ
zh: 手機號碼

source: Email
km: អ៊ីមែល

# emergencyContact
source: Emergency Contact Information
km: ព័ត៌មានទំនាក់ទំនងពេលបន្ទាន់
zh: 緊急聯絡人資訊

source: Emergency Contact Name
km: ឈ្មោះអ្នកទំនាក់ទំនងពេលបន្ទាន់
zh: 緊急聯絡人姓名

source: Emergency Contact Phone
km: ទូរស័ព្ទអ្នកទំនាក់ទំនងពេលបន្ទាន់
zh: 緊急聯絡人電話

# emergencyContactRelation
source: Emergency Contact Relationship
km: ទំនាក់ទំនងជាមួយអ្នកទំនាក់ទំនងពេលបន្ទាន់
zh: 緊急聯絡人關係

source: Medical History
km: ប្រវត្តិវេជ្ជសាស្ត្រពិសេស
zh: 特殊病史

# medicalHistoryHint
source: Please describe any relevant medical conditions or allergies
km: សូមពិពណ៌នាអំពីលក្ខខណ្ឌវេជ្ជសាស្ត្រ ឬការមិនស៊ូមកម្មដែលពាក់ព័ន្ធ
zh: 請描述任何相關的醫療狀況或過敏史

# relationParent
source: Parent
km: ឪពុកម្តាយ
zh: 父母

# relationSpouse
source: Spouse
km: ប្តីភរិយា
zh: 配偶

# relationSibling
source: Sibling
km: បងប្អូន
zh: 兄弟姊妹

# relationChild
source: Child
km: កូន
zh: 子女

# relationFriend
source: Friend
km: មិត្តភក្តិ
zh: 朋友

# relationColleague
source: Colleague
km: សហការី
zh: 同事

# relationOther
source: Other
km: ផ្សេងទៀត
zh: 其他

# validIdRequired
source: Please enter a valid ID number
km: សូមបញ្ចូលលេខអត្តសញ្ញាណប័ណ្ណដែលត្រឹមត្រូវ
zh: 請輸入有效的證件號碼

# validPhoneRequired
source: Please enter a valid phone number
km: សូមបញ្ចូលលេខទូរស័ព្ទដែលត្រឹមត្រូវ
zh: 請輸入有效的手機號碼

# validEmailRequired
source: Please enter a valid email address
km: សូមបញ្ចូលអ៊ីមែលដែលត្រឹមត្រូវ
zh: 請輸入有效的電子郵件地址

source: Search Nationality
km: ស្វែងរកសញ្ជាតិ
zh: 搜尋國籍

# selectNationalityDialog
source: Select Nationality
km: ជ្រើសរើសសញ្ជាតិ
zh: 選擇國籍

source: Marathon Events
km: ព្រឹត្តិការណ៍ម៉ារ៉ាថុន
zh: 馬拉松賽事

source: Search marathon events...
km: ស្វែងរកព្រឹត្តិការណ៍ម៉ារ៉ាថុន...
zh: 搜尋馬拉松賽事...

source: Filter
km: តម្រង
zh: 篩選

source: Clear Filter
km: សម្អាតតម្រង
zh: 清除篩選

source: Filter Marathon Events
km: តម្រងព្រឹត្តិការណ៍ម៉ារ៉ាថុន
zh: 篩選馬拉松賽事

# noMarathonEvents
source: No marathon events found
km: រកមិនឃើញព្រឹត្តិការណ៍ម៉ារ៉ាថុន
zh: 找不到馬拉松賽事

# noMarathonEventsDescription
source: Check back later for upcoming events or adjust your search criteria.
km: សូមពិនិត្យមើលនៅពេលក្រោយសម្រាប់ព្រឹត្តិការណ៍ដែលនឹងមកដល់ ឬកែសម្រួលលក្ខខណ្ឌស្វែងរករបស់អ្នក។
zh: 請稍後再查看即將舉行的賽事或調整您的搜尋條件。

source: Upcoming
km: នឹងមកដល់
zh: 即將舉行

# registrationOpen
source: Open
km: បើកចំហ
zh: 開放

source: Registration Closed
km: ការចុះឈ្មោះបានបិទ
zh: 報名截止

source: Ongoing
km: កំពុងដំណើរការ
zh: 進行中

source: Completed
km: បានបញ្ចប់
zh: 已完成

source: Cancelled
km: បានលុបចោល
zh: 已取消

source: Distance
km: ចម្ងាយ
zh: 距離

source: Location
km: ទីតាំង
zh: 地點

source: Enter location
km: បញ្ចូលទីតាំង
zh: 輸入地點

source: Date Range
km: ជួរកាលបរិច្ឆេទ
zh: 日期範圍

source: Start Date
km: កាលបរិច្ឆេទចាប់ផ្តើម
zh: 開始日期

source: End Date
km: កាលបរិច្ឆេទបញ្ចប់
zh: 結束日期

source: Clear All
km: សម្អាតទាំងអស់
zh: 清除全部

source: Apply
km: អនុវត្ត
zh: 套用

source: Status
km: ស្ថានភាព
zh: 狀態

source: Date not set
km: កាលបរិច្ឆេទមិនបានកំណត់
zh: 日期未設定

source: Marathon Event Details
km: ព័ត៌មានលម្អិតព្រឹត្តិការណ៍ម៉ារ៉ាថុន
zh: 馬拉松賽事詳情

source: Details
km: ព័ត៌មានលម្អិត
zh: 詳情

source: Races
km: ការប្រកួត
zh: 賽事項目

source: Event Description
km: ការពិពណ៌នាព្រឹត្តិការណ៍
zh: 賽事描述

source: Contact Information
km: ព័ត៌មានទំនាក់ទំនង
zh: 聯絡資訊

source: Organizer
km: អ្នករៀបចំ
zh: 主辦單位

source: Website
km: វេបសាយ
zh: 網站

source: Route Map
km: ផែនទីផ្លូវ
zh: 路線圖

source: Notes
km: កំណត់ចំណាំ
zh: 備註

source: Tags
km: ស្លាក
zh: 標籤

source: Race Date
km: កាលបរិច្ឆេទប្រកួត
zh: 比賽日期

source: Registration Deadline
km: ថ្ងៃផុតកំណត់ការចុះឈ្មោះ
zh: 報名截止日期

source: Entry Fee
km: ថ្លៃចូលរួម
zh: 報名費

source: Free
km: ឥតគិតថ្លៃ
zh: 免費

source: Race Full
km: ការប្រកួតពេញ
zh: 名額已滿

source: Registered
km: បានចុះឈ្មោះ
zh: 已報名

source: Register
km: ចុះឈ្មោះ
zh: 報名

source: Event Location
km: ទីតាំងព្រឹត្តិការណ៍
zh: 賽事地點

source: Start Point
km: ចំណុចចាប់ផ្តើម
zh: 起跑點

source: Finish Point
km: ចំណុចបញ្ចប់
zh: 終點

source: Address
km: អាសយដ្ឋាន
zh: 地址

source: Landmark
km: ចំណុចសម្គាល់
zh: 地標

source: Register for Race
km: ចុះឈ្មោះសម្រាប់ការប្រកួត
zh: 報名參賽

source: Participant Name
km: ឈ្មោះអ្នកចូលរួម
zh: 參賽者姓名

source: Please enter participant name
km: សូមបញ្ចូលឈ្មោះអ្នកចូលរួម
zh: 請輸入參賽者姓名

source: Medical Information
km: ព័ត៌មានវេជ្ជសាស្ត្រ
zh: 醫療資訊

source: Registration successful!
km: ការចុះឈ្មោះបានជោគជ័យ!
zh: 報名成功！

source: Registration failed
km: ការចុះឈ្មោះបរាជ័យ
zh: 報名失敗

source: Community
km: សហគមន៍
zh: 社群

source: Events
km: ព្រឹត្តិការណ៍
zh: 賽事

source: No route map available
km: មិនមានផែនទីផ្លូវ
zh: 沒有路線圖

source: Early Bird
km: ការចុះឈ្មោះមុន
zh: 早鳥

source: Early Bird Price
km: តម្លៃការចុះឈ្មោះមុន
zh: 早鳥價格

source: Regular Price
km: តម្លៃធម្មតា
zh: 正常價格

source: Early Bird Until
km: ការចុះឈ្មោះមុនដល់
zh: 早鳥優惠至

# registrationStep1
source: Registration Information
km: ព័ត៌មានចុះឈ្មោះ
zh: 報名資訊

# registrationStep2
source: Payment Method
km: វិធីសាស្ត្រទូទាត់
zh: 付款方式

# fillRegistrationInfo
source: Fill Registration Information
km: បំពេញព័ត៌មានចុះឈ្មោះ
zh: 填寫報名資訊

source: Select Payment Method
km: ជ្រើសរើសវិធីសាស្ត្រទូទាត់
zh: 選擇付款方式

source: Credit Card
km: កាតឥណទាន
zh: 信用卡

source: ABA Payment
km: ការទូទាត់ ABA
zh: ABA支付

# termsAndConditions
source: I agree to the Terms and Conditions
km: ខ្ញុំយល់ព្រមតាមលក្ខខណ្ឌ
zh: 我同意條款與條件

# iAgreeToTerms
source: I agree to the terms and conditions
km: ខ្ញុំយល់ព្រមតាមលក្ខខណ្ឌ
zh: 我同意條款與條件

# pleaseAgreeToTerms
source: Please agree to the terms and conditions
km: សូមយល់ព្រមតាមលក្ខខណ្ឌ
zh: 請同意條款與條件

source: Proceed to Payment
km: បន្តទៅកាន់ការទូទាត់
zh: 前往付款

source: Make Payment
km: ធ្វើការទូទាត់
zh: 進行付款

source: Payment Successful!
km: ការទូទាត់ជោគជ័យ!
zh: 付款成功！

source: Payment Failed
km: ការទូទាត់បរាជ័យ
zh: 付款失敗

# registrationCompleted
source: Registration completed successfully
km: ការចុះឈ្មោះបានបញ្ចប់
zh: 報名完成

source: Back to Events
km: ត្រលប់ទៅបញ្ជីព្រឹត្តិការណ៍
zh: 返回活動列表

source: Payment Amount
km: ចំនួនទឹកប្រាក់ទូទាត់
zh: 付款金額

source: Name
km: ឈ្មោះ
zh: 姓名

source: Please enter name
km: សូមបញ្ចូលឈ្មោះ
zh: 請輸入姓名

source: Please enter email
km: សូមបញ្ចូលអ៊ីមែល
zh: 請輸入Email

# pleaseEnterValidEmail
source: Please enter a valid email
km: សូមបញ្ចូលអ៊ីមែលត្រឹមត្រូវ
zh: 請輸入有效的Email

# selectParticipantCount
source: Select number of participants
km: ជ្រើសរើសចំនួនអ្នកចូលរួម
zh: 選擇參賽人數

# maximumParticipants
source: Maximum 3 participants
km: អព្បរមាអ្នកចូលរួម 3 នាក់
zh: 最多可報名3人

# participantCount
source: Number of participants
km: ចំនួនអ្នកចូលរួម
zh: 參賽人數

source: people
km: នាក់
zh: 人

source: Fill registration data
km: បំពេញពត៌មានចុះឈ្មោះ
zh: 填寫報名資料

source: Participant data
km: ទិន្នន័យអ្នកចូលរួម
zh: 參賽者資料

source: Main contact
km: អ្នកទំនាក់ទំនងចំបាក់
zh: 主要聯絡人

source: Not filled
km: មិនទានបំពេញ
zh: 未填寫

source: Complete
km: បញ្ចប់
zh: 完成

source: QR code data unavailable
km: ទិន្នន័យ QR កូដមិនអាចប្រើបាន
zh: QR碼資料不可用

# qrCodeSavedSuccess
source: QR code saved to gallery
km: QR កូដត្រូវបានរក្សាទុកក្នុងវិចិត្រសាល
zh: QR碼已儲存到相簿

# qrCodeSaveFailed
source: Save failed, please check permissions
km: រក្សាទុកបរសាជ សូមពិនិត្យការអនុញ្ញាត
zh: 儲存失敗，請檢查權限設定

source: Save error
km: កំហុសក្នុងការរក្សាទុក
zh: 儲存時發生錯誤

# shareQrCodeDescription
source: Share or send this QR code to friends to add them to your friends list
km: ចែករំលែក ឬផ្ញើ QR កូដនេះទៅមិត្តភក្តិ ដើម្បីឱ្យពួកគេបន្ថែមអ្នកទៅក្នុងបញ្ជីមិត្តភក្តិ
zh: 分享或發送此QR碼給朋友，讓他們加入你的好友列表
